"""Дан список чисел. Напишите программу, которая определяет, сколько в нем встречается различных чисел, используя множества"""
my_list = input().split(', ')
print(len(set(my_list)))


